---
kind: property
id: P:Autodesk.Revit.DB.Analysis.EnergyAnalysisSurface.Normal
source: html/9d41cdb8-e205-27ba-62bc-380689d6dd13.htm
---
# Autodesk.Revit.DB.Analysis.EnergyAnalysisSurface.Normal Property

The outward normal for this surface.

## Syntax (C#)
```csharp
public XYZ Normal { get; }
```